---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.SingleServerService
source: html/8491691e-2a26-684e-f43c-e8e0095fd129.htm
---
# Autodesk.Revit.DB.ExternalService.SingleServerService

This class represents a single-server service inside Revit application.
 It is created when an instance of ISingleServerService is registered with Revit.

## Syntax (C#)
```csharp
public class SingleServerService : ExternalService
```